In [ ]:
'''
Author      :  PONNAM SRI SAI
Created on  :  12 Feb 2026 06:19:06
Purpose     :
'''

'\nAuthor      :  PONNAM SRI SAI\nCreated on  :  12 Feb 2026 06:19:06\nPurpose     :  \n'

# loading

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
df = pd.read_csv(
        'Week1_GA_dataset.csv',
        na_values=['?']
    )

In [ ]:
df.shape

(10000, 12)

In [ ]:
df.sample(3)

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
3888,2015-04-17,2015,Fairfield,NaN,767500.0,NaN,Detached House,3,2,933.0,1.340225,North
873,2010-04-01,2010,West Hartford,375600.0,610000.0,Single Family,Detached House,3,2,958.0,1.025846,East
8842,2021-08-19,2021,NaN,464790.0,660000.0,Single Family,Detached House,3,3,962.0,1.023495,South

In [ ]:
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_')

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   date               10000 non-null  object
 1   year               10000 non-null  int64
 2   locality           8747 non-null   object
 3   estimated_value    8757 non-null   float64
 4   sale_price         10000 non-null  float64
 5   property           8177 non-null   object
 6   residential        10000 non-null  object
 7   num_rooms          10000 non-null  int64
 8   num_bathrooms      10000 non-null  int64
 9   carpet_area        8771 non-null   float64
 10  property_tax_rate  10000 non-null  float64
 11  face               10000 non-null  object
dtypes: float64(4), int64(3), object(5)
memory usage: 937.6+ KB

# 1


Select all the even indexed rows from the given dataset. What is the value in the 3rd indexed column of the 0th indexed row in the selected dataframe. (row/ column indexed from zero(0) in python/pandas)

In [ ]:
df_selected = df.iloc[::2]
df_selected.head()

,date,year,locality,estimated_value,sale_price,property,residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,face
0,2009-01-02,2009,Waterbury,111440.0,185000.0,Single Family,Detached House,3,3,996.0,1.025953,South
2,2009-01-02,2009,Waterbury,55720.0,140000.0,Single Family,Detached House,3,2,910.0,1.025953,South
4,2009-01-02,2009,Bridgeport,112351.0,210000.0,NaN,Detached House,3,2,1092.0,1.025953,East
6,2009-01-02,2009,Norwalk,571060.0,1000000.0,Single Family,Detached House,3,2,NaN,1.025953,South
8,2009-01-02,2009,NaN,603540.0,1680000.0,Single Family,Detached House,3,1,1039.0,1.025953,East

In [ ]:
df_selected.iat[0, 3]

np.float64(111440.0)

#2

Select all the even indexed rows from the given dataset. What is the value in the 3rd indexed column of the 332th indexed row in the selected dataframe. (row/ column indexed from zero(0))

In [ ]:
df_selected.iat[332, 3]

np.float64(256200.0)

# 3

Select all the odd indexed rows from the given dataset. What is the value in the 3rd indexed column of the 332th indexed row in the selected dataframe. (row/ column indexed from zero(0))

 Please consider case sensitivity while giving your solution capital letter ≠ small letter
  
  If it is a string don't write quotes in the solution.

In [ ]:
odd_index = df.iloc[1::2]
odd_index.head()

,date,year,locality,estimated_value,sale_price,property,residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,face
1,2009-01-02,2009,Bridgeport,124670.0,150000.0,Two Family,Duplex,4,3,1241.0,1.025953,South
3,2009-01-02,2009,Bridgeport,4775276.0,272900.0,Single Family,Detached House,3,1,971.0,1.025953,East
5,2009-01-02,2009,Greenwich,2868880.0,3300000.0,Single Family,Detached House,3,1,1039.0,1.025953,North
7,2009-01-02,2009,Greenwich,592760.0,920000.0,Single Family,Detached House,3,3,937.0,1.025953,North
9,2009-01-02,2009,Bridgeport,137901.0,245000.0,Single Family,Detached House,3,1,956.0,1.025953,West

In [ ]:
odd_index.iat[332, 3]

np.float64(352940.0)

#4


2 points
Select all the odd indexed columns from the given dataset. What is the value in the 5th indexed column of the 100th indexed row in the selected dataframe. (row/ column indexed from zero(0))

Please consider case sensitivity while giving your solution capital letter ≠ small letter

If it is a string don't write quotes in the solution.

In [ ]:
odd_index.iat[100, 5]

'Single Family'

#5

Select all the even indexed columns and even indexed rows from the given dataset. What is the value in the 3th indexed column of the 255th indexed row in the selected dataframe. (row/ column indexed/starts from zero(0))

Please consider case sensitivity while giving your solution capital letter ≠ small letter

If it is a string don't write quotes in the solution.

In [ ]:
even_indexed = df.iloc[::2, ::2]
even_indexed.head()

,date,locality,sale_price,residential,num_bathrooms,property_tax_rate
0,2009-01-02,Waterbury,185000.0,Detached House,3,1.025953
2,2009-01-02,Waterbury,140000.0,Detached House,2,1.025953
4,2009-01-02,Bridgeport,210000.0,Detached House,2,1.025953
6,2009-01-02,Norwalk,1000000.0,Detached House,2,1.025953
8,2009-01-02,NaN,1680000.0,Detached House,1,1.025953

In [ ]:
even_indexed.iat[255, 3]

'Detached House'

#6

Determine the number of samples (rows) in the dataset that belong to the six most recent years, based on the provided data.

In [ ]:
df['year'].unique()

array([2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019,
       2020, 2021, 2022])

In [ ]:
df['year'].max()

2022

In [ ]:
recent_6_years = df[df['year'] > (df['year'].max() - 6)]

In [ ]:
recent_6_years.shape

(4749, 12)

# 7

Determine the number of samples (rows) in the dataset which has num_rooms = 3 and num_bathrooms = 3

In [ ]:
df[(df['num_rooms'] == 3) & (df['num_bathrooms'] == 3)].shape

(2730, 12)

#8

Determine the number of samples (rows) in the dataset which has num_rooms = 3 or num_bathrooms = 3

In [ ]:
df[(df['num_rooms'] == 3) | (df['num_bathrooms'] == 3)].shape

(8591, 12)

# 9

In the Year 2022, how many houses (rows) located in the Greenwich Locality have exactly num_room == 3, and facing towards either the North or East?

In [ ]:
df[(df['year'] == 2022) & (df['locality'] == 'Greenwich') & (df['num_rooms'] == 3) & (df['face'].isin(['North', 'East']))].shape

(42, 12)

#10

Calculate the number of samples(rows) that correspond to the month of August across all the years.?

In [ ]:
df['date'] = pd.to_datetime(df['date'], errors='coerce')

In [ ]:
(df['date'].dt.month == 8).sum()

np.int64(1050)

#11

According to the data which Locality have highest average Sale Price?

In [ ]:
x = df.groupby('locality')['sale_price'].mean()
x

locality
Bridgeport       1.740953e+05
Fairfield        7.277225e+05
Greenwich        2.270224e+06
Norwalk          5.590959e+05
Stamford         6.305313e+05
Waterbury        1.062152e+05
West Hartford    3.385472e+05
Name: sale_price, dtype: float64

In [ ]:
x.idxmax()

'Greenwich'